
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СформироватьДиаграммуПосещенияАттракционов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьДиаграммуПосещенияАттракционов()
	
	ПосещенияАттракционов.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПосещенияАттракционовОбороты.Аттракцион,
		|	ПосещенияАттракционовОбороты.КоличествоОборот КАК КоличествоПосещений,
		|	ПосещенияАттракционовОбороты.Период КАК День
		|ИЗ
		|	РегистрНакопления.ПосещенияАттракционов.Обороты(,, День,) КАК ПосещенияАттракционовОбороты";
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Точка = ПосещенияАттракционов.УстановитьТочку(Выборка.День);
		Серия = ПосещенияАттракционов.УстановитьСерию(Выборка.Аттракцион);
		
		ПосещенияАттракционов.УстановитьЗначение(Точка, Серия, Выборка.КоличествоПосещений);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
