
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура Загрузить(Команда)
	
	ТекстВопроса = НСтр("ru = 'В таблицу уже введены цены. При загрузке таблица будеи очищена. Продолжить?'");
	
	Ответ = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
	Если Не Ответ = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов();
	ПараметрыДиалога.Фильтр = НСтр("ru = 'Файл Excel|*.xlsx'");
		
	РезультатПомещения = Ждать ПоместитьФайлНаСерверАсинх(, , , ПараметрыДиалога);
	
	Если РезультатПомещения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатПомещения.ПомещениеФайлаОтменено Тогда
		Возврат;
	КонецЕсли;
	
	ОбработатьФайлЦен(РезультатПомещения.Адрес);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбработатьФайлЦен(Адрес)
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(Адрес);
	
	ИмяФайла = ПолучитьИмяВременногоФайла("xlsx");
	ДвоичныеДанные.Записать(ИмяФайла);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Прочитать(ИмяФайла);
	
	Объект.ЦеныНоменклатуры.Очистить();
	
	Для НомерСтроки = 2 По ТабличныйДокумент.ВысотаТаблицы Цикл
		
		Строка = Объект.ЦеныНоменклатуры.Добавить();
		
		Наименование = ТабличныйДокумент.Область(НомерСтроки, 1).Текст;
		Цена = ТабличныйДокумент.Область(НомерСтроки, 2).Текст;
		
		Строка.Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(Наименование);
		Строка.Цена = Число(Цена);
		
	КонецЦикла;
	
	УдалитьФайлы(ИмяФайла);
	
КонецПроцедуры

#КонецОбласти
