// @strict-types


#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ВидНоменклатуры = Перечисления.ВидНоменклатуры.ПосещениеАттракциона Тогда
		НомерУдаляемого = ПроверяемыеРеквизиты.Найти("КоличествоПосещений");
		Если Не НомерУдаляемого = Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(НомерУдаляемого);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
